export const MENTORING_BENEFITS_LIST: Array<string> = [
  'Робота з ментором - це персональна ініціатива учня, тут немає перездач, та відчислень. Спілкуйтесь з ментором у комфортному форматі у зручний час',
  'Ви можете працювати з ментором на будь якому етапі професійної карʼєри. Ставте цілі і досягайте їх швидше з порадами досвідченого спеціаліста',
  'Отримайте доступ до великої бази даних із додатковою літературою, посиланнями на корисні ресурси та матеріалами, які допоможуть прокачати свою експертність.',
];

export const MENTORING_PROCESS_LIST: Array<string> = [
  'Ви залишаєте заявку на сайті, з описом навичок та з чим потрібна допомога ментора',
  'Ментор оцінює задачу, та звʼязується з вами, для обговорення деталей та розкладу',
  'На першому етапі - знайомство з ментором, визначення ваших задач та цілей в IT.',
  'Далі - аналіз та розробка плану розвитку. На цьому етапі ментор допомагає вам з навчанням та пропонує оптимальні рішення ',
  'Сумісна робота та залучення. Ментор допомагає рухатись у правильному напрямку, не заважаючи власному розвитку учня',
  'Якщо ви постаєте перед труднощами, ментор допомагає вам у вирішенні проблем та мотивує у подальшому рості, надаючи регулярний фідбек',
];

export const MENTORING_DIRECTIONS_LIST: Array<string> = [
  'Q.A. Engineer',
  'Project Manager',
  'Business Analyst',
];

export const MENTORING_TITLE: string = 'Meнторство з Niko IT Academy';
export const MENTORING_SUBTITLE: string = '[ Побудуйте план розвитку і реалізуйте його з підтримкою наставника ]';
export const MENTORING_BENEFITS_TITLE: string = 'Переваги менторства';
export const MENTORING_PROCESS_TITLE: string = 'Як відбувається менторство';
export const MENTORING_DIRECTION_BG_TEXT: string = 'Напрямки';
export const MENTORING_DIRECTION_SUBTITLE: string = 'Напрямки, у якому наш ментор має експертність та практичний досвід 6+ років';
