export const AboutUsSection = () => {
  return (
    <section className="flex flex-col md:flex-row gap-4 lg:gap-14 items-center mx-3 md:mx-4 lg:mx-24 py-8 md:py-14 lg:py-[200px] z-10 relative">
      <h2 className="uppercase text-primary-accent text-6xl md:text-[6.5rem] lg:text-[220px] leading-none font-unbounded font-medium">
        Про нас
      </h2>
      <p className="font-medium lg:text-2xl">
        Niko IT Academy це Українсько - Канадська онлайн академія заснована у 2020 році викладачем та екпертом в IT індустрії - Наталі
        Ятшинець. Головна ціль академії - надати студентам шанс отримати цінний досвіт та створити власний проєкт, під керівництвом
        досвідченоного вчителям та успішного IT Фахівця. Ми слідкуємо за розвитком та тенденціями ринку, для випуску цінних фахівців у
        своїй галузі, а також даємо найбільш корисну інформацію, яка у майбутньому допомагає студентам отримати бажану роботу.
        <br/>
        <br/>
        В умовах постійних змін та викликів ми забезпечуємо нашим студентам стійкість та гнучкість, необхідні для успіху у сучасній
        IT-сфері. Наша школа відмінно справляється з поставленною задачею, адже 90% студентів отримують роботу у накоротший час. Ми
        підтримуємо наших студентів, допомагаємо досягти успіху та випускаємо на ринок праці професіоналів.
      </p>
    </section>
  );
};
