import { StudyGuideInterface } from '@/interfaces/study-guide.interface';

export const STUDY_GUIDE_LIST: Array<StudyGuideInterface> = [
  {
    id: 1,
    title: 'Отримуєте та вивчайте навчальні матеріали у персональному кабінеті',
    description: 'Заняття включають в себе відеолекції, вебінари та практичні завдання. Ви займаєтесь по розкладу, але завжди будете мати змогу повернутись на початок, або передивитись лекцію в записі. Записи лекцій зберігаються 1 рік.',
    imageUrl: '/study-guide/1.webp',
  },
  {
    id: 2,
    title: 'Отримуєте зворотній звʼязок по виконаним завданням',
    description: 'Куратор або лектор дає розгорнуту відповідь по практичним завданням, або відповідають на ваші запитання. Також у вас буде змога отримати спілкування та обмін знаннями зі своїми одногрупнниками у приватних чатах.',
    imageUrl: '/study-guide/2.webp',
  },
  {
    id: 3,
    title: 'Отримуєте підтримку від ваших наставників',
    description: 'Куратори допомагатимуть вам розібратись у складних темах, отримати відповіть на своє запитання та виконане завдання. Куратори відповідать на організаційні запитання, нагадують про дедлайни, підтримують вас та мотивують на вашому шляху.',
    imageUrl: '/study-guide/3.webp',
  },
  {
    id: 4,
    title: 'Навчайтесь у зручному для вас темпі, або у записі',
    description: 'На усіх курсах є розклад занять та дедлайни практичних завдань, але ми з розумінням ставимось до вашого особистого часу, тому якщо ви розумієте, що не встигаєте виконати завдання або прийти на оналайн - лекцію, ми допоможемо вам посунути дедлайни, та проходити навчання у записі.',
    imageUrl: '/study-guide/4.webp',
  },
];

export const TEACHER_ACHIEVEMENTS: Array<string> = [
  'Менеджер з доставки в Grid Dynamics',
  'Керівник проекту в Randstad',
  'Засновник Niko IT Academy',
  'Працювала в топ компаніях світу (Randstad, Grid Dynamics, GIS Art, Impressit, Omilia)',
  'Сертифікований Scrum Master та Product Owner',
  'Практикуючий тренер та коуч міжнародного рівня',
  'Випустила понад 2000 студентів, які успішно працюють в IT',
];

export const TEACHER_ACHIEVEMENTS_IMAGES: Array<string> = [
  '/teacher-achievements/1.png',
  '/teacher-achievements/2.png',
  '/teacher-achievements/3.png',
  '/teacher-achievements/4.png',
  '/teacher-achievements/5.png',
  '/teacher-achievements/6.jpeg',
];
