export const TITLE = 'Політика конфіденційності';
export const DESCRIPTION = 'Ця політика конфіденційності пояснює, як ми збираємо, використовуємо та захищаємо ваші особисті дані на нашому вебсайті. Продовжуючи використовувати наш вебсайт, ви погоджуєтесь з цією політикою.';

export const PARAGRAPHS = [
  {
    title: 'Збір та використання інформації:',
    content: 'Ми збираємо особисту інформацію, яку ви нам надаєте під час реєстрації та замовленні курсів або спілкуванні з нашою командою менеджменту та підтримки. Ця інформація використовується виключно для належного надання послуг, обробки платежів та покращення вашого досвіду користувача.'
  },
  {
    title: 'Захист інформації:',
    content: 'Ми вживаємо всі необхідні заходи безпеки для запобігання несанкціонованому доступу або розголошенню вашої особистої інформації. Ваші дані захищено від втрати, зловживання або зміни.',
  },
  {
    title: 'Розголошення інформації третім сторонам:',
    content: 'Ми не розголошуємо ваші особисті дані третім сторонам без вашого дозволу, за винятком випадків, коли це необхідно для надання послуг (наприклад, обробка платежів).',
  },
];

export const QUESTIONS_PARAGRAPH = 'Якщо у вас є будь-які питання щодо нашої політики конфіденційності, будь ласка, зв\'яжіться з нами через нашу сторінку з контактною інформацією.';

export const GRATITUDE = 'Дякуємо, що обрали нас.'
