export const TITLE = 'Публічна оферта';

export const DESCRIPTION = 'Цей текст є публічною офертою від ФІЗИЧНОЇ ОСОБИ-ПІДПРИЄМЦЯ Наталії Миколаївни Яцишинець, що діє на підставі свідоцтва про реєстрацію суб’єкта підприємницької діяльності, що надалі іменується «Виконавець» на визначених Договором умовах, і адресований фізичним особам, які відповідають вимогам даного Договору. Договір вважається укладеним у порядку ст. 642 Цивільного кодексу України та набуває чинності договору приєднання з моменту вчинення Вами дій, передбачених п. 3.3.1. цього Договору, що означає повне та беззастережне прийняття Вами всіх умов Договору без будь-яких винятків та/або обмежень (акцепт).';

export const LIST = [
  {
    title: 'Визначення термінів',
    items: [
      {
        title: 'Договір (оферта) – це публічний договір між Замовником та Виконавцем щодо надання послуг. Договір укладається шляхом акцепту Замовником цієї оферти і є договором приєднання, який може бути укладений лише шляхом приєднання Замовником до всього запропонованого договору.',
      },
      {
        title: 'Сайт – це веб-сторінка, яка доступна в мережі Інтернет за доменним ім\'ям: <a href="www.onlyenglish.com.ua">www.onlyenglish.com.ua</a>, а також всі інші (будь-які) суб-домени або під-домени цього ресурсу.',
      },
      {
        title: 'Акцепт оферти (прийняття пропозиції) – це повне та беззастережне погодження Замовником умов, викладених у цьому Договорі, за допомогою належної оплати вартості послуг. Договір, укладений Замовником через акцепт цієї оферти, має юридичну силу відповідно до статті 642 Цивільного кодексу України і рівнозначний договору, укладеному сторонами у письмовій формі. При здійсненні оплати згідно з умовами цього Договору вважається, що Замовник ознайомлений та погоджується з усіма умовами цієї пропозиції.',
      },
      {
        title: 'Виконавець – ФОП Яцишинець Наталія Миколаївна.',
      },
      {
        title: 'мовник – це особа (або потенційний користувач) послуг Виконавця відповідно до умов цієї Оферти. Він передав свої персональні дані та погодився на їх обробку. Замовник є повнолітньою фізичною особою, яка досягла 18 років і має законне право укладати договірні відносини з Виконавцем.',
      },
      {
        title: 'Курс – це комплексний навчальний матеріал, створений з використанням унікального контенту на одну або кілька тем будь-якого напряму в сфері інформаційних технологій. Характеристики курсу визначаються відповідно до пропозиції курсу.',
      },
      {
        title: 'Контент – це матеріали, такі як вебінари, аудіо- та відеозаписи, текстові документи, графіка та інші ресурси, які розроблені, організовані та надані для використання Замовником.',
      },
      {
        title: 'Пропозиція Курсу – це інформація, розміщена на веб-сайті, що містить характеристики курсу, тривалість, формат, терміни проведення навчання, способи доступу до курсу, а також правила проходження курсу та інші особливості.',
      },
      {
        title: 'Посилання на сайт – це літерно-цифровий код або інший ідентифікатор, який дає можливість отримати доступ до веб-сайту Виконавця через Інтернет.',
      },
      {
        title: 'Персональне посилання – це індивідуальний літерно-цифровий або інший код, який надає Замовнику доступ до конкретного навчального курсу.',
      },
      {
        title: 'Викладач – це особа, яка безпосередньо веде заняття з навчального курсу.',
      },
      {
        title: 'Заняття – це дистанційні заняття з викладачем, які проводяться за допомогою певного програмного забезпечення.',
      },
      {
        title: 'Повідомлення про оплату – це повідомлення, яке надсилається Виконавцем на електронну пошту, вказану Замовником, або через смс на вказаний номер мобільного телефону, і містить інформацію про вартість послуг, банківські реквізити для оплати тощо. Строк дії такого повідомлення становить 30 календарних днів з моменту його відправлення Виконавцем, після чого воно стає недійсним.',
      },
      {
        title: 'Сторони – Виконавець та Замовник.',
      },
    ],
  },
  {
    title: 'Предмет Договору',
    items: [
      {
        title: 'Цей Договір передбачає надання освітніх послуг додаткової освіти Замовнику від ФОП Яцишинець Наталії Миколаївни відповідно до обраного переліку освітніх курсів, що розміщені на веб-сайті <a href="https://www.nikoit-academy.com/">https://www.nikoit-academy.com/</a>',
      },
      {
        title: 'Обсяг та характеристики послуг згідно цього Договору визначаються обраним та оплаченим Замовником Курсом, згідно з відповідною пропозицією курсу.',
      },
      {
        title: 'Даний Договір вважається укладеним без подальшого підписання сторонами письмових екземплярів з моменту, коли Виконавець отримує від Замовника відповідну оплату за послуги, вказані в цьому Договорі (з дати отримання оплати на банківський рахунок Виконавця).',
      },
      {
        title: 'Послуги, надані за цим Договором, не підпадають під визначення освітніх послуг згідно з Законом України "Про освіту".',
      },
      {
        title: 'Кожна сторона гарантує іншій стороні, що вона має необхідну дієздатність та всі необхідні права та повноваження для укладення та виконання цього Договору згідно з його умовами.',
        items: [
          {
            title: 'Виконавець не зобов’язаний перевіряти відповідність Замовника вимогам Договору (п. 1.5.) та не несе відповідальності у разі невідповідності Замовника.',
          },
        ],
      },
      {
        title: 'Усі умови Договору викладені у цій оферті є обов’язковими для Сторін. Перед початком використання послуг Замовник зобов’язаний ознайомитись з умовами цього Договору та іншою інформацією, опублікованою на Сайті Виконавця.',
      },
      {
        title: 'Особа, яка не погоджується з умовами Договору, не може бути її Стороною і має утриматися від реєстрації на навчання. Особа, яка приймає умови Договору, підтверджує своє ознайомлення та згоду з усіма умовами цього Договору і вважається Замовником відповідно до його умов. Замовник може самостійно в будь-який момент ознайомитись з умовами Договору на сайті Виконавця та зобов\'язаний періодично перечитувати інформацію на сайті Виконавця, зокрема з метою ознайомлення з важливою інформацією щодо навчання, яка може періодично оновлюватись.',
      },
      {
        title: 'Цей Договір може бути змінений Виконавцем в односторонньому порядку без попереднього та подальшого повідомлення про це Замовника. Зміни набирають чинності з моменту опублікування нової редакції Договору на Сайті. Редакція цього Договору, що діє, доступна (опублікована) в мережі Інтернет за адресою <a href="https://www.nikoit-academy.com/">https://www.nikoit-academy.com/</a>',
      },
      {
        title: 'Замовник розуміє та підтверджує, що його згода з умовами цього Договору та/або використанням ним Сайту після публікації нової редакції Договору означає згоду Замовника з оновленими умовами Договору. Якщо Замовник не погоджується з новими умовами Договору, він повинен припинити користування послугами Виконавця.',
      },
    ],
  },
  {
    title: 'Порядок укладання Договору',
    items: [
      {
        title: 'Розміщення тексту цього Договору на Сайті є пропозицією (офертою) Виконавця фізичним особам, які виявили бажання замовити послуги Виконавця з онлайн навчання та укласти цей Договір на зазначених у ньому умовах.',
      },
      {
        title: 'Оферта може бути акцептована (прийнята) будь-якою фізичною особою, яка відповідає вимогам цього Договору та бажає придбати послуги Виконавця.',
      },
      {
        title: 'Оферта вважається акцептованою Замовником, якщо він вчинив такі дії в їх сукупності:',
        items: [
          {
            title: 'належним чином сплатив послуги Виконавця відповідно до повідомлення про оплату, отриманого від Виконавця.',
          },
          {
            title: 'реквізити для оплати послуг Виконавця зазначаються у повідомленні про оплату.',
          },
          {
            title: 'Особа, яка не виконала п. 3.3.1 цього Договору, не є Замовником.',
          },
        ],
      },
      {
        title: 'Акцепт цієї оферти підтверджує, що Замовник ознайомлений з усіма умовами, викладеними в цьому Договорі, розуміє їх та приймає всі ці умови в повному обсязі, без винятків. Замовник також згоден і беззастережно приймає всі умови обраного та сплаченого ним Курсу, які розміщені на Сайті Виконавця.',
      },
      {
        title: 'Термін акцепту необмежений.',
      },
      {
        title: 'Договір вважається укладеним та набирає чинності з моменту акцепту і діє протягом всього терміну отримання послуг від Виконавця Замовником або до моменту його розірвання згідно з умовами Договору та відповідно до чинного законодавства України.',
      },
      {
        title: 'Умови цього Договору діють для будь-якого Курсу навчання із зазначених на Сайті.',
      },
      {
        title: 'Умови Договору залишаються для Замовника незмінними з моменту повної оплати обраного Курсу та до завершення Виконавцем занять з цього Курсу.',
      },
      {
        title: 'Виконавець має право розірвати Договір у разі порушення Замовником умов цього Договору. Повідомлення про розірвання Договору Виконавець надсилає Замовнику на електронну адресу, вказану при реєстрації, або за допомогою смс-повідомлення на номер мобільного телефону, вказаний Замовником. У разі розірвання Договору грошові кошти, сплачені Замовником за курс, не повертаються',
      },
    ],
  },
  {
    title: 'Порядок участі у навчанні',
    items: [
      {
        title: 'Для участі в онлайн навчанні Замовнику необхідно виконати всі умови цього Договору.',
      },
      {
        title: 'Для участі в онлайн навчанні Замовник самостійно забезпечує дотримання належних технічних умов для персонального комп’ютера та/або іншого пристрою.',
      },
      {
        title: 'Виконавець не несе відповідальності за неможливість участі Замовника в онлайн навчанні, яка виникла з причин, що не залежать від Виконавця, включаючи випадки невиконання Замовником умов, зазначених у пункті 4.2 Договору та інші події.',
      },
      {
        title: 'Виконавець має право за власним розсудом змінювати розклад занять, їх тривалість та час проведення, попередньо повідомивши про це Замовника. Проте загальна кількість занять, передбачених курсом, не може бути меншою, ніж у Пропозиції курсу, яка була актуальною на момент оплати. У разі зміни дати або часу проведення заняття Виконавець повідомляє Замовника шляхом надсилання повідомлення на вказану ним електронну адресу, за доступними методами комунікації або через Особистий кабінет.',
      },
      {
        title: 'У разі зміни дати або часу проведення заняття Виконавець повідомляє Замовника шляхом надсилання повідомлення на вказану ним електронну адресу, за доступними методами комунікації або через Особистий кабінет.',
      },
      {
        title: 'Виконавець має право не допустити до участі у занятті Замовника, який порушив чи не виконав умови цього Договору. Про це Виконавець повідомляє Замовнику про доступні методи комунікацій.',
      },
      {
        title: 'У разі пропуску Замовником заняття з причин, які не залежать від Виконавця, Замовник не має права вимагати його повторного проведення.',
      },
      {
        title: 'Під час проведення заняття Замовники можуть ставити питання щодо теми та змісту заняття, за наявності технічних можливостей, якщо Викладач не встановив іншого порядку постановки питань та відповідей на них. Однак, Виконавець може встановлювати обмеження щодо всього курсу навчання або певних занять.',
      },
      {
        title: 'Після завершення курсу навчання Виконавець приймає рішення щодо видачі або невидачі сертифікатів Замовникам в залежності від їхніх результатів навчання.',
        items: [
          {
            title: 'Замовник погоджується з тим, що Виконавець може видати сертифікат тільки у разі, якщо Замовник успішно виконує більше ніж 40% завдань, передбачених курсом, або відвідає більше ніж 70% занять, наданих курсом, і за результатами підсумкового завдання, якщо таке передбачене.',
          },
          {
            title: 'Замовники, які не виконали вимоги, викладені в п. 4.9.1. Договору сертифікати не отримують.',
          },
        ],
      },
    ],
  },
  {
    title: 'Права та обов’язки Виконавця',
    items: [
      {
        title: 'Виконавець зобов’язаний:',
        items: [
          {
            title: 'При умові прийняття Договору та виконанням Замовником умов цього Договору, Виконавець забезпечує Замовнику доступ до обраного ним Курсу відповідно до характеристик і правил проходження Курсу. У випадку створення Виконавцем спільних чатів для спілкування Замовників, Виконавець також надає Замовнику доступ до спільного чату у месенджері.',
          },
          {
            title: 'На вимогу Замовника надати йому консультацію та інформацію про Курс.',
          },
          {
            title: 'На Сайті, у тексті цього Договору, у Пропозиції Курсу та/або іншим доступним для ознайомлення Замовника способом, інформувати Замовника про правила та вимоги щодо організації Курсу, про його зміст та характеристики, про права та обов’язки Сторін при наданні та отриманні послуг, якщо такий був передбачений цим курсом.',
          },
        ],
      },
      {
        title: 'Виконавець має право:',
        items: [
          { title: 'Змінювати, оновлювати та вдосконалювати пропозицію курсу відповідно до власного рішення, враховуючи потреби ринку навчання в галузі інформаційних технологій, актуальні тенденції та запити потенційних Замовників.' },
          { title: 'Може вирішувати питання щодо можливості повернення Замовнику сплачених грошових коштів за курс, якщо Замовник не розпочав навчання за курсом, на підставі заяви Замовника та за своїм розсудом.' },
          { title: 'Припинити доступ Замовника до Особистого кабінету та до всіх загальних чатів на будь-якому етапі Курсу, у випадках: порушення Замовником правил поведінки під час проходження курсу. Зазначеними порушеннями є: розпалювання міжнаціональних конфліктів, образу учасників Курсу, викладача, примус їх відхилення від теми Курсу, реклама, нецензурні висловлювання тощо; порушення Замовником своїх обов’язків, передбачених Главою 6 цього Договору; порушення Замовником умов Угоди; встановлення факту порушення Замовником прав інтелектуальної власності Виконавця, інших Замовників, викладачів, третіх осіб; встановлення факту передачі Замовником реквізитів для доступу до Курсу третім особам, розповсюдження Замовником інформації та матеріалів, отриманих ним у зв’язку з участю у Курсі, третім особам за плату або безкоштовно; використання Замовником інформації та матеріалів, отриманих в результаті отримання послуг Виконавця, з іншою метою, крім особистого некомерційного використання; не повну оплату Замовником за надані послуги згідно з пунктом 7.4 повернення коштів Замовнику.' },
          { title: 'Відповідно до цього пункту Договору, Виконавець має право залучати до виконання цього Договору третіх осіб шляхом укладання з ними окремих договорів та враховувати умови конфіденційності в таких угодах; передавати свої права та обов\'язки за цим Договором третім особам без попереднього погодження з Замовником. Виконавець несе відповідальність перед Замовником за дії третіх осіб, як за власні дії.' },
        ],
      },
    ],
  },
  {
    title: 'Права та обов’язки Замовника',
    items: [
      {
        title: 'Замовник зобов’язаний:',
        items: [
          { title: 'Не менше ніж за 1 день проінформувати замовника про скасування або перенесення заняття. Бути онлайн не менш як за 5 хвилин до початку заняття. У разі неявки на заплановане заняття протягом 20 хвилин після його початку, урок списується автоматично.' },
          { title: 'Сплатити послуги Виконавця відповідно до умов цього Договору.' },
          { title: 'Виконувати вимоги цього Договору, правила та порядок проходження Курсу, дотримуватись вимог законодавства України при виконанні цього Договору та проходження Курсу.' },
          { title: 'Утримуватися від:\n• поведінки, яка може завадити іншим учасникам Курсу, викладачам та іншим особам брати участь у Курсі чи отримувати інформацію під час проведення Курсу;\n• поширення недостовірної, неправдивої інформації, а також інформації, що може ганьбити честь, гідність, ділову репутацію Виконавця, інших замовників, викладачів, третіх осіб. Заборонено поширювати інформацію, що спонукає або закликає до міжнаціональної, етнічної, расової нетерпимості, ворожнечі, війни, а також будь-яку інформацію, поширення якої заборонено чинним законодавством України та нормами міжнародного права.' },
          { title: 'Утримуватися від будь-яких дій, які не передбачені самим Договором, проте можуть містити склад кримінального чи адміністративного правопорушення, або порушувати права та законні інтереси Виконавця, інших замовників, викладачів або третіх осіб.' },
          { title: 'Не відтворювати, не повторювати, не копіювати, не продавати та не використовувати з будь-якою іншою метою інформацію та матеріали, які стали йому доступні у зв’язку з наданням послуг Виконавцем та доступом до Курсу. Замовник може використовувати ці матеріали виключно для особистих та некомерційних цілей.' },
        ],
      },
      {
        title: 'Замовник має право:',
        items: [
          {
            title: 'Вибрати Курс навчання відповідно до власних потреб.',
          },
          {
            title: 'Отримати послуги відповідно до умов цього Договору.',
          },
          {
            title: 'Звернутися до Виконавця з письмовою заявою щодо вирішення питання про повернення коштів, сплачених за Курс, до закінчення 48 (сорок восьми) годин після завершення першого заняття з Курсу.',
          },
        ],
      },
    ],
  },
  {
    title: 'Порядок розрахунків',
    items: [
      { title: 'Ціна послуг, вказана в цьому Договорі, виражена в національній валюті. Оплата здійснюється в національній валюті відповідно до курсу в день оплати.' },
      { title: 'Вартість Курсу, яка застосовується, - це та, яка була чинною на момент зарахування відповідної оплати на банківський рахунок Виконавця.' },
      { title: 'Вартість Курсу залишається незмінною для Замовника з моменту належної оплати та до закінчення навчання за сплаченим Курсом.' },
      { title: 'Оплата вартості послуг Виконавця за цим Договором здійснюється у вигляді: повної 100% (стовідсоткової) передоплати, або з можливістю розтермінування (за індивідуальної потреби Замовника)' },
      { title: 'Кошти, перераховані Замовником за послуги Виконавця, зараховуються на банківський рахунок Виконавця виключно у національній валюті України.' },
      { title: 'Якщо Замовник обирає оплату за послуги Виконавця в іноземній валюті, він повинен скористатися платіжною системою, доступною на сайті, для перерахування і сплати суми відповідно до поточного курсу обміну.' },
      { title: 'Замовник повинен бути готовий додатково оплатити будь-які комісії, які стягуються банками або платіжними системами за проведення платежу або за конвертацію валют. Ці комісійні витрати не включаються у вартість послуг, визначену в Договорі, і Замовник зобов\'язаний їх оплатити окремо. Також, у разі повернення Виконавцем повної або часткової оплати за послуги, Замовник також несе всі пов\'язані з цим витрати.' },
      { title: 'Послуги вважаються сплаченими у момент зарахування належної оплати за Курс на рахунок, вказаний Виконавцем у Повідомленні про оплату.' },
      { title: 'Актуальна інформація про знижки на вартість певного Курсу (Курсів) розміщується на Сайті.' },
      { title: 'Загальна знижка на вартість Курсу не може перевищувати 50% (п’ятдесят відсотків) від повної вартості Курсу.' },
      { title: 'Однакові знижки не поєднуються і не підсумовуються шляхом складання номіналу знижок між собою.' },
      {
        title: 'За необхідності повернення коштів Замовник повинен зв\'язатися з Виконавцем за контактним телефоном, який вказаний на Сайті, та оформити запит на повернення коштів. Після цього Замовник повинен надіслати Виконавцю скан копії заяви про повернення коштів з електронної адреси, вказаної при реєстрації, або з іншої зручної адреси електронної пошти. У заяві мають бути вказані прізвище, ім\'я, по батькові, назва курсу, дата замовлення, інформація про платежі (сума, дата перерахування), а також причини відмови від послуг.',
        items: [
          {
            title: 'Відповідно до умов договору, у разі неналежного оформлення запиту про повернення коштів та/або відсутності у заяві про повернення необхідної інформації Виконавець має право не розглядати таку заяву Замовника і не несе за це відповідальності.',
          },
        ],
      },
      {
        title: 'Так, відповідно до цих умов, при поверненні коштів Виконавець використовує той самий засіб платежу, який використовував Замовник. У випадку, якщо Замовник використовував кілька різних платіжних засобів, Виконавець може обрати будь-який з них для повернення коштів. Крім того, будь-які додаткові послуги та комісії банків та платіжних систем, пов’язані з поверненням платежу, будуть утримані із суми повернення коштів.',
      },
      {
        title: 'Строк розгляду Виконавцем будь-яких заяв Замовника про повернення коштів, сплачених за Курс, становить 20 (двадцять) календарних днів з моменту отримання належним чином оформленої заяви Замовника.',
      },
    ],
  },
  {
    title: 'Відповідальність сторін',
    items: [
      { title: 'За невиконання або неналежне виконання зобов’язань, зазначених у Договорі, Сторони несуть відповідальність відповідно до чинного законодавства України та вимог Договору.' },
      { title: 'У разі, якщо Замовник не вніс оплату за надання послуг вчасно або не в повному обсязі, Виконавець має право розірвати Договір і відмовити Замовнику у допуску до проходження курсу без повернення внесеної оплати.' },
      { title: 'У разі порушення Замовником прав інтелектуальної власності Виконавця, Викладачів, інших Замовників, у тому числі у разі передачі Замовником будь-якої інформації, матеріалів, отриманих під час проходження Курсу, третім особам при виявленні фактів використання Замовником зазначених матеріалів, інформації з комерційною метою, Замовник несе таку відповідальність:' },
      { title: 'Будь-які дії Замовника, спрямовані на перешкоду наданню послуг Виконавцем іншим Замовникам або які призвели до ненадання або неналежного надання послуг за умовами Договору, можуть призвести до його розірвання без повернення суми оплати Замовнику.' },
      { title: 'Це може включати будь-які дії, що порушують умови Договору або завдають шкоди іншим учасникам процесу навчання або викладачам.' },
      { title: 'Це положення спрямоване на забезпечення належного функціонування та проведення навчального процесу без перешкод та завад.' },
      {
        title: 'Виконавець не несе відповідальності за:',
        items: [
          {
            title: 'неможливість надання послуг з причин, що від нього не залежать, включаючи форс-мажорні обставини, порушення роботи ліній зв’язку, відсутність або несправність обладнання, яке не належить Виконавцю, відсутність та/або погіршення якості зв’язку та передачі даних, що надаються мобільними операторами та Інтернет-провайдерами;',
          },
          {
            title: 'порушення безпеки обладнання або несправність обладнання, яке використовується Замовником для отримання послуг;',
          },
          {
            title: 'будь-які збитки Замовників чи третіх осіб, які виникли не з вини Виконавця.',
          },
        ],
      },
      {
        title: 'Інформація про конкретний Курс та особливості доступу Замовника до Курсу (у тому числі технічні характеристики обладнання, необхідного для доступу до Курсу) надається Замовнику. Якщо технічне обладнання Замовника не відповідає вимогам, Виконавець не несе відповідальності за неможливість Замовника отримати доступ до Курсу. Це означає, що Замовник має власну відповідальність за переконання, що його технічне обладнання відповідає потребам Курсу.',
      },
      {
        title: 'У разі порушення Виконавцем термінів надання послуг відповідальність Виконавця обмежується продовженням строків надання послуг або наданням послуг у нові строки до повного їх виконання.',
      },
      {
        title: 'У будь-якому випадку сукупна відповідальність Виконавця перед Замовником за будь-яким позовом або претензією цього Договору обмежується розміром вартості послуги, наданої за Договором.',
      },
    ],
  },
  {
    title: 'Інтелектуальна власність',
    items: [
      { title: 'Замовник має право використовувати контент, курси та матеріали, які він отримав під час надання послуг Виконавцем, лише для особистих некомерційних цілей. Використання цих матеріалів з будь-якою іншою метою є забороненим.' },
      { title: 'Виконавець має всі виняткові майнові права інтелектуальної власності на контент та курси, які надаються, включаючи право захищати ці права від протиправного використання третіми особами шляхом вжиття відповідних заходів.' },
      { title: 'Виконавець не надає Замовнику жодних прав на використання знаків для товарів та послуг, які можуть бути утримані в контенті, курсах, а також на сайті.' },
      { title: 'У випадку, якщо існують обґрунтовані підозри щодо порушення прав інтелектуальної власності третіми особами, які містяться у контенті, курсах або на сайті, Виконавець може призупинити доступ до цих матеріалів без попереднього та подальшого повідомлення Замовника. Виконавець не несе відповідальності за внесення таких змін.' },
    ],
  },
  {
    title: 'Відмова від гарантій',
    items: [
      { title: 'Замовник погоджується, що використовує послуги Виконавця виключно на власний розсуд та несе за це односторонню відповідальність.' },
      { title: 'Виконавець не несе відповідальності за будь-які можливі неотримані результати, досягнення, придбання, доходи, репутаційні ризики та інші можливі наслідки, які можуть виникнути при використанні послуг Виконавця.' },
      { title: 'Результати, які досягаються різними Замовниками при використанні послуг Виконавця, можуть суттєво відрізнятися навіть при використанні тих самих послуг. Замовник звільняє Виконавця від будь-яких претензій, які можуть виникнути щодо результатів використання послуг Виконавця.' },
      { title: 'Замовника повідомлено про те, що його незгода з думкою викладачів та змістом курсів навчання не є підставою для повернення сплачених коштів.' },
    ],
  },
  {
    title: 'Обставини непереборної сили (форс-мажор)',
    items: [
      {
        title: 'Жодна зі сторін не несе відповідальності перед іншою стороною за будь-які збитки або втрати, що можуть виникнути в результаті невиконання або несвоєчасного виконання цього Договору, якщо таке невиконання або затримка були спричинені обставинами непереборної сили поза контролем сторін і якщо сторони не були недбалі у виконанні своїх обов\'язків.',
      },
      {
        title: 'Такі обставини, події чи причини включають (перелік не є винятковим) наступне: загроза війни, збройного конфлікту або серйозна загроза такого конфлікту, ворожі атаки, блокади, ембарго, дії іноземного ворога, загальна військова мобілізація, військові дії, оголошена та неоголошена війна, дії громадського ворога, обурення, акти тероризму, диверсії, піратство, заворушення, вторгнення, блокада, революція, заколот, повстання, масові заворушення, введення комендантської години, експропріація, примусове вилучення, захоплення підприємств, реквізиція, громадська демонстрація, блоку протиправні дії третіх осіб, пожежа, вибух, тривалі перерви у роботі транспорту, регламентовані умовами відповідних рішень та актами державних органів влади, закриття морських проток, заборона (обмеження) на експорт/імпорт тощо, а також спричинені винятковими погодними умовами та стихійними лихами, а саме: епідемії, епізоотії, пандемії, сильний шторм, циклон, ураган, торнадо, повінь, нагромадження снігу, ожеледиця, град, заморозки, замерзання моря, проток портів, перевали, землетрус, блискавка, пожежа, посуха, просідання і зсуви, інші стихійні лиха. п.',
      },
      {
        title: 'Факт настання та тривалості дії обставин форс-мажору має бути підтверджено документально компетентним державним органом відповідно до чинного законодавства України. У разі виникнення форс-мажорних обставин Сторона, виконанню чиїх зобов’язань перешкоджають такі обставини, повинна сповістити про це іншу Сторону протягом 10 (десяти) календарних днів з дати їх появи.',
      },
      {
        title: 'Виконавець має право повідомляти Замовників про настання обставин непереборної сили шляхом розміщення відповідної інформації на Сайті. Замовники вважаються повідомленими з моменту розміщення інформації про обставини непереборної сили на Сайті.',
      },
    ],
  },
  {
    title: 'Додаткові умови',
    items: [
      {
        title: 'Підписанням цього Договору Замовник надає Виконавцю згоду у порядку ст. ст. 307, 308 Цивільного кодексу України про те, що він може бути знятий на фото-, кіно-, теле- чи відеоплівку. Фотографія, інші художні твори, на яких зображено Замовник, можуть бути публічно показані, відтворені, розповсюджені Виконавцем у рекламних, навчальних та інших цілях. При цьому всі авторські та суміжні права на отримані фото- та відеоматеріали у будь-якому вигляді та на будь-яких носіях належать Виконавцю та не можуть бути використані без його згоди.',
        items: [
          {
            title: 'Якщо Замовник заперечує використання його зображень на зазначених матеріалах, він повинен письмово сповістити про це Виконавця до початку Курсу навчання, належним чином заповнивши відповідну заяву та надіславши її Виконавцю на адресу  management@nikoitacademy.com. За інформацією щодо порядку оформлення такої заяви Замовник повинен звернутися до Виконавця за телефонами, вказаними на сайті.',
          },
        ],
      },
      {
        title: 'До цього Договору та його тлумачення застосовується законодавство України. Усі суперечки за цим Договором вирішуються у судах України. У всьому, що не врегульовано цим Договором, Сторони керуються нормами чинного законодавства України.',
      },
      {
        title: 'Досудовий претензійний порядок вирішення спорів між сторонами є обов’язковим за цим Договором. Строк розгляду претензії становить 20 (двадцять) календарних днів із моменту її отримання.',
      },
      {
        title: 'У разі якщо суперечку неможливо вирішити у претензійному порядку, будь-яка із Сторін має право звернутися до суду. Сторони домовилися, що всі суперечки за цим Договором вирішуються в суді за місцезнаходженням Виконавця.',
      },
    ],
  },
  {
    title: 'Реквізити',
    items: [
      {
        title: 'ФОП Яцищинець Наталія Миколаївна</br>ЄДРПОУ № 3057704582',
      },
    ],
  },
];
