export const BENEFITS_FOR_STUDENTS_LIST: Array<string> = [
  'Курси побудовані на експертності та власному досвіді викладача, яка пройшла шлях від QA до Project Manager.',
  'Без застарілої інформації. Ми дбаємо про те, щоб наші студенти мали доступ до найсучасніших технологій.',
  'Жодної сухої теорії та “води”, цей курс випускає компетентних студентів, які розуміються на вирішені робочих задач',
  'Отримаєте чітке розуміння та всі навички, які знадобляться вам у майбутній професії',
  'Зрозумієте, як працює IT “кухня”з середини, та що очікувати при роботі з клієнтами, та реальними кейсами',
  'Після закінчення курсу, ви отримаєте знання, які допоможуть вам пройти співбесіду, та підготують до роботи.',
];
