import { CourseInterface } from '@/interfaces/course.interface';

export const COURSES_LIST: Array<CourseInterface> = [
  {
    id: 1,
    name: 'Q.A. Engineer ',
    previewImage: '/courses/qa-course.png',
    level: 'Початківцям',
    duration: '3 місяці',
    countOfModules: 10,
    slug: 'qa-engineer',
    overview: [
      'Спеціаліст, відповідальний за забезпечення якості програмного забезпечення',
      'Володіє навичками тестування різних аспектів програмного забезпечення, такі як функціональність та продуктивність.',
      'Вони розробляють тестові сценарії, виконують тести на виявлення помилок',
      'QA Engineers виявляють і документують дефекти, співпрацюючи з розробниками для їх виправлення',
      'QA Engineers працюють як частина розробних команд, співпрацюючи з розробниками та менеджерами проєкті',
      'Ця професія вимагає аналітичного мислення, дотримання методологій тестування та постійного оновлення знань',
    ],
    goals: [
      'Ви навчитесь тестувати веб та додатки. Вивчите види та рівні тестування, створите та оформите тестові сценарії',
      'Напишете звіти. Локалізуєте баги, опишете дефекти, визначите критичність і приоритети багів. Протестуєте вимоги',
      'Навчитесь системному адмініструванню. Дізнаєтесь більше про операційні системи та мережеві технології',
      'Зрозумієте, як відбувається розробка програмного забезпечення та хто бере участь в процесі',
      'Вивчите що таке SDLC та STLC, навчитесь техніками тест-дизайну та Software testing types',
      'Бонус - онлайн тренінг “Співбесіда в IT” та тренінг “Методологія управління проєктами SCRUM”',
    ],
    overviewImage: '/courses/overview/qa-overview.webp',
    courseProgram: [
      {
        id: 1,
        title: 'Бази Даних MySQL',
        lessons: [
          'Таблиці Бази данних',
          'Фільтрація та вибірка',
          'Сортування, ліміт та агрегативні функції',
        ],
        objective: 'Ви будете чітко розуміти, як створються бази данних, від планування до впровадження. Дізнаєтесь, як редагувати, оновлювати та сортувати таблиці.',
      },
      {
        id: 2,
        title: 'Адміністрування',
        lessons: [
          'Операційні системи',
          'Віртуалізація',
          'Мережеві технології та локальний сервер',
        ],
        objective: 'Ви розберетесь у призначенні, процесі встановлення та адмініструванні операційних систем. Зрозумієте призначення, типи та основні властивості віртуалізації.',
      },
      {
        id: 3,
        title: 'Тестування ПЗ  1.0',
        lessons: [
          'SDLC та STLC',
          'Test design techniques',
          'Requirement analysis and practice',
          'Buying page',
        ],
        objective: 'Ви розберетесь, як тестувати програмне забезпечення, щоб знаходити та виправляти помилки. Зрозумієте, як організувати та провести тестування ПЗ на всіх його етапах.',
      },
      {
        id: 4,
        title: 'Тестування ПЗ  2.0',
        lessons: [
          'UI Elements',
          'Software Testing Types',
          'Test management System',
          'Defects Tracking',
        ],
        objective: 'Зрозумієте всі типи та елементи тестування. Вивчете систему управління тестами та навчитесь виявляти та відстежувати дефекти (баги).',
      },
      {
        id: 5,
        title: 'Тестування ПЗ  3.0',
        lessons: [
          'Test Monitoring and control',
          'API - Testing and Tools',
          'Mobile Testing',
        ],
        objective: 'Ви детально розберетеся в особливостях та нюансах різних типів тестування і зможете підібрати оптимальну стратегію під будь-який проект.',
      },
      {
        id: 6,
        title: 'Project & Selenium',
        lessons: [
          'Project Calculator',
          'Web Project',
          'Selenium',
        ],
        objective: 'Навчитесь аналізу технічного завдання; вивчення кінцевих макетів; тест кейсів; матриці відповідності. Навчитесь користуватись масштабним open source проектом - Selenium.',
      },
      {
        id: 7,
        title: 'Бонус',
        lessons: [
          'Тренінг "Співбесіда в IT"',
          'Тренінг "Методологія управління проєктами Scrum"',
        ],
        objective: 'На тренінгах ви навчитесь проходити співбесіди, та отримаєте цінні навички, які допоможуть вам в майбутній професії. Також вам буде доступний бонусний тренінг з Метології SCRUM.',
      },
    ],
    courseTitle: 'Курс QA Engineer в IT | NIKO IT ACADEMY',
    courseDescription: 'QA Engineer курс, де Ви навчитесь тестувати веб та додатки  та зрозумієте як відбується розробка. Приєднуйтесь до курсів тестування у нашій академії.',
    microdata: {
      '@context': 'https://schema.org',
      '@type': 'Event',
      'name': 'QA Engineer Курс',
      'description': 'QA Engineer курс, де Ви навчитесь тестувати веб та додатки та зрозумієте як відбується розробка. Приєднуйтесь до курсів тестування у нашій академії.',
      'startDate': '2024-04-19',
      'endDate': '2024-07-19',
      'organizer': {
        '@type': 'Person',
        'name': 'Наталія Яцишинець',
      },
      "location": {
        "@type": "VirtualLocation",
        "name": "Online"
      },
    },
  },
  {
    id: 2,
    name: 'Project Manager',
    previewImage: '/courses/pm-course.webp',
    level: 'Початківцям',
    duration: '3 місяці',
    countOfModules: 10,
    slug: 'project-manager',
    overview: [
      'Професія передбачає відповідальність за успішне виконання проектів від початку до кінця',
      'Керують роботою команди, розподіляючи завдання, встановлюючи цілі та графіки, сприяють співпраці',
      'Відповідають за управління ресурсами проекту, включаючи людські, фінансові та матеріальні ресурси',
      'Вони встановлюють та підтримують зв\'язок з клієнтами, командою, керівництвом та іншими відділами компанії',
      'Забезпечують виконання проектів у межах бюджету та строків, а також досягнення поставлених цілей',
      'Ця професія вимагає стратегічного мислення, лідерських якостей, вміння приймати рішення ',
    ],
    goals: [
      'Ви ознайомитесь з основними методологіями управління проєктами, такими як Waterfall, Agile, Scrum тощо.',
      'Навчитесь розробляти детальні проектні плани з урахуванням вимог, ресурсів, часових обмежень та ризиків.',
      'Будете ефективно взаємодіяти з усіма учасниками проєкту, управляти очікуваннями стейкхолдерів та забезпечувати звітність проєкту',
      'Зможете ідентифікувати, аналізувати та керувати ризиками проєкту, а також забезпечувати високу якість виконання робіт за допомогою відповідних методик та контрольних точок.',
      'Навчитесь ефективно реагувати на зміни в проєкті, вносити корективи до планів та ресурсного розподілу, а також забезпечувати гнучке виконання завдань',
      'Ви успішно завершите проєкт, у зручній для замовника формі та проведете постпроєктний аналіз для вивчення вчинків та покращення майбутніх проєктів',
    ],
    overviewImage: '/courses/overview/pm-overview.webp',
    courseProgram: [
      {
        id: 1,
        title: 'Введення в управління',
        lessons: [
          'Запровадження управління проєктами',
          'Знайомство з Agile',
        ],
        objective: 'Ви отримаєте загальне уявлення про управління проектами та засвоєте основні принципи методології Agile, що дозволить вам розпочати роботу над проектами відразу після завершення модуля',
      },
      {
        id: 2,
        title: 'Роль проєкту і керівника',
        lessons: [
          'Середовище проєкту',
          'Роль керівника проєкту',
        ],
        objective: 'Ви здобудете розуміння ролі керівника проєкту та середовища проєкту, що допоможе вам ефективно керувати ресурсами та забезпечити успішне виконання завдань',
      },
      {
        id: 3,
        title: 'Групи Процесів',
        lessons: [
          'Група процесів ініціації',
          'Група процесів планування',
          'Група процесу виконання проєкту',
        ],
        objective: 'Ви та інші Учасники оволодієте навичками визначення мети проєкту, а також розробки стратегій та планів дій для його реалізації, що покращить вашу здатність до організації та планування проектів',
      },
      {
        id: 4,
        title: 'Моніторинг і контроль',
        lessons: [
          'Моніторинг проєкту',
          'Контроль проєкту',
        ],
        objective: 'Ви та інші студенти оволодієте методиками виконання проекту та контролю його прогресу, що допоможе вам ефективно управляти ресурсами та вчасно виявляти та вирішувати проблеми.',
      },
      {
        id: 5,
        title: 'Agile підходи та практики',
        lessons: [
          'Agile світогляд',
          'Види гнучких практик',
        ],
        objective: 'Ви детально розберетеся в особливостях та нюансах різних типів тестування і зможете підібрати оптимальну стратегію під будь-який проект.',
      },
      {
        id: 6,
        title: 'Scrum',
        lessons: [
          'Практика Scrum',
          'Робота з Командами у Scrum',
          'Ролі керівників у Scrum',
          '4 рівні планування проєкту',
        ],
        objective: 'У вас буде можливість вивчити та перевірити знання на командних практиках у методології  Scrum',
      },
      {
        id: 7,
        title: 'Бонус',
        lessons: [
          'Тренінг "Співбесіда в IT"',
          'Тренінг "Методологія управління проєктами Scrum"',
        ],
        objective: 'На тренінгах ви навчитесь проходити співбесіди, та отримаєте цінні навички, які допоможуть вам в майбутній професії. Також вам буде доступний бонусний тренінг з Метології SCRUM.',
      },
    ],
    courseTitle: 'Курс Project Manager в IT | NIKO IT ACADEMY',
    courseDescription: 'Курс Project manager, де Ви ознайомитесь з основними методологіями управління проєктами, в IT. Приєднуйтесь до курсів Project Manager у нашій академії.',
    microdata: {
      '@context': 'https://schema.org',
      '@type': 'Event',
      'name': 'PROJECT MANAGER Курс',
      'description': 'PROJECT MANAGER курс, де Ви знайомитесь з основними методологіями управління проєктами та навчитесь розробляти детальні проектні плани. Приєднуйтесь до курсів тестування у нашій академії.',
      'startDate': '2024-04-19',
      'endDate': '2024-07-19',
      'organizer': {
        '@type': 'Person',
        'name': 'Наталія Яцишинець',
      },
      "location": {
        "@type": "VirtualLocation",
        "name": "Online"
      },
    },
  },
  {
    id: 3,
    name: 'Business Analyst',
    previewImage: '/courses/ba-course.webp',
    level: 'Початківцям',
    duration: '3 місяці',
    countOfModules: 10,
    slug: 'business-analyst',
    overview: [
      'Професійний аналітик, який вивчає бізнес-потреби компанії та перетворює їх на вимоги до програмного забезпечення',
      'Використовує аналітичні методи та інструменти для збору, аналізу та документування вимог користувачів',
      'Business Analyst виступає посередником між бізнес-замовниками та розробницькою командою',
      'Вони розробляють бізнес-моделі, виконують SWOT-аналізи для ідентифікації стратегічних можливостей та загроз',
      'Володіють навичками взаємодії з різними зацікавленими сторонами для проведення ефективних комунікацій',
      'Ця професія вимагає аналітичного мислення, стратегічного планування та глибокого розуміння бізнес-процесів',
    ],
    goals: [
      'Отримаєте глибоке розуміння ролі бізнес-аналітика в процесі розробки програмного забезпечення та управління проєктами',
      'Засвоїте основні техніки бізнес-аналізу, такі як еліцитація вимог, аналіз бізнес-процесів, моделювання даних та інші',
      'Ознайомитесь з основними етапами SDLC та роль бізнес-аналітика на кожному з них. Ви також отримаєте уявлення про різні методології розробки',
      'Навчитесь управляти зацікавленими сторонами проєкту, розробляти плани комунікації та використовувати ефективні методи взаємодії з стейкхолдерами',
      'Зможете ефективно ідентифікувати, класифікувати та управляти вимогами проєкту, та отримаєте досвід роботи з різними типами вимог',
      'Навчитесь ідентифікувати, оцінювати та управляти ризиками проєкту. Ви також отримаєте знання про різні типи моделей, такі як BPMN та UML',
    ],
    overviewImage: '/courses/overview/ba-overview.webp',
    courseProgram: [
      {
        id: 1,
        title: 'Основи Бізнес Аналітики',
        lessons: [
          'Course overview',
          'Business Analyst Role overview',
          'Business analysis Technics Theory',
          'Групова практика',
        ],
        objective: 'Ви, як студент здобудете розуміння базових концепцій та технік Бізнес Аналізу, які готові для застосування на практиці',
      },
      {
        id: 2,
        title: 'SDLC',
        lessons: [
          'Agile, Waterfall та інші метології',
          'Stakeholders identification',
          'Stakeholders management',
        ],
        objective: 'Ви оволодієте навичками управління вимогами від стейкхолдерів, зрозумієте їхню роль в розробці ПЗ та зможете ефективно взаємодіяти з ними',
      },
      {
        id: 3,
        title: 'Аналіз Вимог',
        lessons: [
          'Stakeholders classification',
          'Communication plan',
          'Requirements identification, classification',
          'Requirements management',
        ],
        objective: 'Як студент ви вже навчитесь ефективно аналізувати, документувати та управляти вимогами проєкту з врахуванням життєвого циклу розробки',
      },
      {
        id: 4,
        title: 'Управління Backlog',
        lessons: [
          'Requirements Documentation',
          'Decomposition and prioritization',
          'Backlog management',
          'Change management',
        ],
        objective: 'Ви зможете ефективно розробляти та управляти Backlog проєктом з використанням різних технік та інструментів',
      },
      {
        id: 5,
        title: 'Ризики та Моделювання',
        lessons: [
          'Risk\'s identification and evaluation',
          'Risk\'s management',
          'Different types of models',
          'BPMN & UML Group Practice ',
        ],
        objective: 'Ви зможете ефективно керувати ризиками проєкту та застосовувати різні моделі для моделювання бізнес-процесів',
      },
      {
        id: 6,
        title: 'Інтерфейси взаємодії',
        lessons: [
          'Характеристики основних типів додатків',
          'Особливості та структура XML, JSON',
          'Застосування REST, SOAP',
          'Види тестування за часом проведення',
        ],
        objective: 'У вас буде можливість вивчити та перевірити знання на командних практиках у методології  Scrum',
      },
      {
        id: 7,
        title: 'Професійний розвиток',
        lessons: [
          'How to improve hard skills',
          'Business Analysis Levels',
          'Групова презентація проєктів',
          'Ретроспектива при закінчені курсу',
        ],
        objective: 'Ви, та інші студенти, які закінчили навчання будете готові до вступу на ринок праці як професійні Бізнес Аналітики, знаючи основні принципи та методики своєї області',
      },
    ],
    courseTitle: 'Курс Business Analysis в IT | NIKO IT ACADEMY',
    courseDescription: 'Курс Business Analysis, де Ви отримаєте глибоке розуміння ролі бізнес-аналітика в процесі розробки програмного забезпечення. Приєднуйтесь до курсів Business Analysis в IT у нашій академії.',
    microdata: {
      '@context': 'https://schema.org',
      '@type': 'Event',
      'name': 'BUSINESS ANALYST Курс',
      'description': 'BUSINESS ANALYST курс, де Ви отримаєте глибоке розуміння ролі бізнес-аналітика та засвоїте основні техніки бізнес-аналізу. Приєднуйтесь до курсів тестування у нашій академії.',
      'startDate': '2024-04-19',
      'endDate': '2024-07-19',
      'organizer': {
        '@type': 'Person',
        'name': 'Наталія Яцишинець',
      },
      "location": {
        "@type": "VirtualLocation",
        "name": "Online"
      },
    },
  },
];

export const MINI_COURSE: CourseInterface = {
  id: 4,
  slug: 'mini-course',
  overviewImage: '',
  name: 'Міні-Курс',
  overview: [],
  goals: [],
  level: 'Початківцям',
  duration: '',
  courseProgram: [],
  courseTitle: 'Каталог міні-курсів NIKO IT ACADEMY',
  courseDescription: 'Каталог міні - курсів NIKO IT ACADEMY,  де Ви зможете знайти собі курс за потребами',
} as unknown as CourseInterface;

export const ALL_COURSES_LIST = COURSES_LIST.concat(MINI_COURSE);
