import { FAQQuestion } from '@/interfaces/faq-question.interface';

export const FAQ_QUESTIONS_LIST: Array<FAQQuestion> = [
  {
    id: 1,
    question: 'Чи можу я навчатись без досвіду в IT?',
    answer: 'Всі наші курси орієнтовані на початківців, які раніше не мали досвіду в IT. Матеріал пояснюється легкою мовою, також у вас буде змога отримати зворотній звʼязок від куратора.',
  },
  {
    id: 2,
    question: 'Які методи навчання ви використовуєте на своїй платформі?',
    answer: 'На наших курсах у навчанні використовуються інтерактивні методи, такі як: Відеоуроки; Інтерактивні лекції; Групові проєкти та віртуальні класи. Ми чудово знаємо як мотивувати студента, допомагаємо поглибити знання та опанувати нові навички.',
  },
  {
    id: 3,
    question: 'Чи отримаю я якесь підтвердження по закінченню курсу? ',
    answer: 'При успішному закінчені курсу, ви отримаєте цифровий сертифікат. Але у першу чергу наша мета - надати знання, що відповідають вимогам вакансій на ринку праці.',
  },
  {
    id: 4,
    question: 'Чи будуть домашні завдання при самостійному проходжені курсу?',
    answer: 'Домашня робота – це практика, з допомогою якої закріплюються знання. Вони мають рекомендаційний характер, щоб ви напрацьовували портфоліо під час навчання, та більшість з них є обов\'язковими.',
  },
  {
    id: 5,
    question: 'Як мені визначити який курс найкраще підійде для мене?',
    answer: 'Як мені визначити який курс найкраще підійде для мене?',
  },
];
