import { StudentStoryInterface } from '@/interfaces/student-story.interface';

export const STUDENT_STORIES_LIST: Array<StudentStoryInterface> = [
  {
    id: 1,
    name: 'Христина',
    story: 'Викладач Наталія подавала матеріал курсу з великою ефективністю, ділиться особистим досвідом та надає практичні поради. Її відкритість та готовність допомогти роблять навчання легким та приємним.',
    image: 'feedback/feedback1.svg',
  },
  {
    id: 2,
    name: 'Андрій',
    story: 'Навчання на курсі QA у Наталії було дуже корисним та пізнавальним досвідом. Отримавши глибокі знання з тестування програмного забезпечення, я зрозумів процеси та методології, що лежать в основі забезпечення якості продукту.',
    image: 'feedback/feedback2.svg',
  },
  {
    id: 3,
    name: 'Тетяна',
    story: 'Навчання на курсі дозволило глибше зрозуміти процеси та методології тестування ПЗ. Робота в команді та спілкування з колегами також були корисними для розвитку співпраці та комунікації.',
    image: 'feedback/feedback3.svg',
  },
  {
    id: 4,
    name: 'Микола',
    story: 'У Наталії поданий матеріал був насиченим та систематизованим, презентації включали лише потрібну інформацію. Курс включав не лише теорію, а й практику, що допомогло в пошуках роботи. ',
    image: 'feedback/feedback4.svg',
  },
  {
    id: 5,
    name: 'Еміль',
    story: 'Підхід Наталії до навчання робить складні моменти зрозумілими, а її практичні знання та навички корисними для подальшої кар\'єри в QA. Навчання на курсі дозволило глибше зрозуміти процеси та методології тестування ПЗ.',
    image: 'feedback/feedback5.svg',
  },
]
